Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1"
	xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
	xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
	<vendor>WCH Ltd.</vendor>                                       <!-- device vendor name -->
	<vendorID>WCH</vendorID>                                        <!-- device vendor short name -->
	<name>CH564</name>
	<version>1.1</version>
	<description>CH564 View File</description>
	<!--Bus
	Interface Properties-->
	<!--RISC-V
	is byte addressable-->

	<addressUnitBits>8</addressUnitBits>
	<!--the
	maximum data bit width accessible within a single transfer-->
	<width>64</width>
	<!--Register
	Default Properties-->
	<size>0x40</size>
	<resetValue>0x0</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>

	<peripherals>

		<peripheral>
			<name>SYS</name>
			<description>SYS register</description>
			<groupName>SYS</groupName>
			<baseAddress>0x40400000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PA</name>
				<description>PA external interrupt</description>
				<value>28</value>
			</interrupt>
			<interrupt>
				<name>PB</name>
				<description>PB external interrupt</description>
				<value>29</value>
			</interrupt>
			<interrupt>
				<name>PD</name>
				<description>PD external interrupt</description>
				<value>30</value>
			</interrupt>
			<interrupt>
				<name>SLV</name>
				<description>SLV global interrupt</description>
				<value>32</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_SAFE_ACCESS_SIG</name>
					<description>safe accessing sign register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>R8_SAFE_ACCESS_SIG</name>
							<description>safe accessing sign register</description>
							<bitRange>[7:0]</bitRange>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SAFE_ACCESS_ID</name>
					<description>safe accessing ID register</description>
					<addressOffset>0x02</addressOffset>
					<size>0x8</size>
					<access>read-only</access>
					<resetValue>0x01</resetValue>
					<fields>
						<field>
							<name>R8_SAFE_ACCESS_ID</name>
							<description>safe accessing ID</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_WDOG_CLEAR</name>
					<description>watch-dog clear register</description>
					<addressOffset>0x03</addressOffset>
					<size>0x8</size>
					<access>write-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>R8_WDOG_CLEAR</name>
							<description>watch-dog clear</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_GLOB_MEM_CFG</name>
					<description>Memory configuration register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x8</size>
					<resetValue>0x82</resetValue>
					<fields>
						<field>
							<name>RB_GLOB_MEM_CFG</name>
							<description>Memory configuration</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_GLOB_CFG_FLAG</name>
							<description>Memory configuration flag</description>
							<bitRange>[7:6]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_GLOB_LOCK_PORT</name>
					<description>Global port lock configuration register</description>
					<addressOffset>0x05</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0xC0</resetValue>
					<fields>
						<field>
							<name>RB_GLOB_LOCK_PA</name>
							<description>PA port lock configuration</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_GLOB_LOCK_PB</name>
							<description> PB port lock configuration</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_GLOB_LOCK_PD</name>
							<description>PD port lock configuration</description>
							<bitRange>[3:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_GLOB_RST_CFG</name>
					<description>Globally reset the configuration register</description>
					<addressOffset>0x06</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_GLOB_WDOG_EN</name>
							<description>enable watch-dog reset</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_GLOB_RESET_KEEP</name>
					<description>value keeper during global reset</description>
					<addressOffset>0x07</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>R8_GLOB_RESET_KEEP</name>
							<description>value keeper during global reset</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_PLL_OUT_DIV</name>
					<description>output clock divider from PLL</description>
					<addressOffset>0x09</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x94</resetValue>
					<fields>
						<field>
							<name>RB_PLL_SYS_DIV</name>
							<description>System clock division factor</description>
							<bitRange>[7:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLP_CLK_OFF0</name>
					<description>sleep clock off control byte 0</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SLP_CLK_TMR0</name>
							<description>sleep TMR0 clock</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_SLP_CLK_TMR1</name>
							<description>sleep TMR1 clock</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SLP_CLK_TMR2</name>
							<description>sleep TMR2 clock</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_SLP_CLK_TMR3</name>
							<description>sleep TMR3 clock</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_SLP_CLK_SPI0</name>
							<description>sleep SPI0 clock</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SLP_CLK_SPI1</name>
							<description>sleep SPI1 clock</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_SLP_CLK_UART0</name>
							<description>sleep UART0 clock</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_SLP_CLK_UART1</name>
							<description>sleep UART1 clock</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLP_CLK_OFF1</name>
					<description>sleep clock off control byte 1</description>
					<addressOffset>0x0D</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SLP_CLK_UTMI</name>
							<description>sleep UTMI clock</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLP_CLK_I2C</name>
							<description>sleep I2C clock</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLP_CLK_USBPD</name>
							<description>sleep USBPD clock</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLP_CLK_ADC</name>
							<description>sleep ADC clock</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLP_CLK_GPIO</name>
							<description>sleep GPIO clock</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLP_CLK_USB</name>
							<description>sleep USB clock</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLP_CLK_ETH</name>
							<description>sleep Ethernet clock</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLP_WAKE_CTRL</name>
					<description>wake control</description>
					<addressOffset>0x0E</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x80</resetValue>
					<fields>
						<field>
							<name>RB_SLP_PA_WAKE</name>
							<description>enable PA waking</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_SLP_PB_WAKE</name>
							<description>enable PB waking</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SLP_USBPD_WAKE</name>
							<description>enable USBPD waking</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_SLP_PD_WAKE</name>
							<description>enable PD waking</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_SLP_USB_WAKE</name>
							<description>enable USB waking</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SLP_WOL_WAKE</name>
							<description>enable Ethernet WOL waking</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_SLP_ETH_PWR_DN</name>
							<description>Ethernet module power control</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLP_CTRL_PLL</name>
					<description>PLL SLEEP control</description>
					<addressOffset>0x0F</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SLP_WOL_STATUS</name>
							<description>Current ethernet WOL remote wake-up signal status</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_SLP_CLK_UART2</name>
							<description>sleep UART2 clock</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLP_CLK_UART3</name>
							<description>sleep UART3 clock</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_XBUS_CONFIG</name>
					<description>external bus configuration</description>
					<addressOffset>0x10</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_XBUS_ENABLE</name>
							<description>external bus enable</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_XBUS_EN_32BIT</name>
							<description>external bus data control enable</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_XBUS_ADDR_OE</name>
							<description>external bus address output enable</description>
							<bitRange>[3:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_XBUS_CYCLE</name>
					<description>external bus read/write cyccles register</description>
					<addressOffset>0x12</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x04</resetValue>
					<fields>
						<field>
							<name>RB_XBUS_CYCLE</name>
							<description>external bus read/write cyccles</description>
							<bitRange>[4:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_XBUS_SETUP_HOLD</name>
					<description>external bus holdtime setting register</description>
					<addressOffset>0x13</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x04</resetValue>
					<fields>
						<field>
							<name>RB_XBUS_HOLD</name>
							<description>Number of external bus read/write signal end point clock</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RB_XBUS_SETUP</name>
							<description>The address of the external bus and the creation time of
								the data</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLV_CONFIG</name>
					<description>SLV configuration register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SLV_ENABLE</name>
							<description>SLV enable bit</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLV_IE_CMD</name>
							<description>The command writes the interrupt enable bit</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLV_IE_WR</name>
							<description>Data writes the interrupt enable bit</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SLV_IE_RD</name>
							<description>Data read the interrupt enable bit</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLV_DOUT</name>
					<description>SLV data output register</description>
					<addressOffset>0x16</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SLV_DOUT</name>
							<description>SLV data output</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLV_STATUS</name>
					<description>SLV status output register</description>
					<addressOffset>0x17</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SLV_STATUS</name>
							<description>SLV status output</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_INT_FLAG_SLV</name>
					<description>SLV interrupt flag register</description>
					<addressOffset>0x42</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_IF_SLV_CMD1</name>
							<description>The state of the original SLV address line 1</description>
							<bitRange>[2:2]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_IF_SLV_CMD1_SYNC</name>
							<description>The status of the SLV address line 1 after synchronization</description>
							<bitRange>[3:3]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_IF_SLV_CMD0</name>
							<description>The original SLV command input flag bit</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_IF_SLV_CMD</name>
							<description>The synchronized SLV command input flag bits</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_IF_SLV_WR</name>
							<description>SLV data input interrupt flag bit</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_IF_SLV_RD</name>
							<description>SLV data output interrupt flag bit</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_INT_SLV_DIN</name>
					<description>SLV data input register</description>
					<addressOffset>0x43</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>INT_SLV_DIN</name>
							<description>SLV data input</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_DMA_EN_SLV</name>
					<description>SLV DMA enable register</description>
					<addressOffset>0x180</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DMA_EN_SLV</name>
							<description>SLV DMA mode enable control bit</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_DMA_RESP_IE_SLV</name>
							<description>SLV DMA error transmission interrupts enable control bit</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_DMA_END_IE_SLV</name>
							<description>SLV DMA error transmission end enable control bit</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_DMA_LOOP_EN_SLV</name>
							<description>SLV DMA cyclic address mode control bits</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_DMA_FIFO_OV_IE_SLV</name>
							<description>The FIFO full state interrupts the enable bit</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_DMA_OTHER_IE_SLV</name>
							<description>when in compatibility mode, Transmission of non-DMA data
								state interrupts the enable bit</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_DMA_WR_8BIT</name>
							<description>selection of transfer data length for DMA write operations</description>
							<bitRange>[6:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_DMA_MODE_CTRL_SLV</name>
					<description>SLV DMA mode control register</description>
					<addressOffset>0x181</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>CMD0_WR_MODE</name>
							<description>DMA transfer command word 0 read and write type</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CMD1_WR_MODE</name>
							<description>DMA transfer command word 1 read and write type</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_DMA_MODE_EN_SLV</name>
					<description>SLV DMA mode enable register</description>
					<addressOffset>0x182</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0xC0</resetValue>
					<fields>
						<field>
							<name>CMD0_EN</name>
							<description>DMA transfer command word 0 control bit</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CMD1_EN</name>
							<description>DMA transfer command word 1 control bit</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DMA_CMD_MODE1</name>
							<description>DMA transfer command word mode1</description>
							<bitRange>[3:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_DMA_INT_FLAG_SLV</name>
					<description>SLV DMA interrupt flag register</description>
					<addressOffset>0x184</addressOffset>
					<size>0x8</size>
					<resetValue>0x40</resetValue>
					<fields>
						<field>
							<name>WR_DMA_END_IF</name>
							<description>DMA receive mode transmission end flag bit</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>WR_DMA_RESP_IF</name>
							<description>DMA receive mode transmission error flag bit</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RD_DMA_END_IF</name>
							<description>DMA occurrence mode transmission end flag bit</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RD_DMA_RESP_IF</name>
							<description>DMA occurrence mode transmission error flag bit</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>WR_DMA_OV_IF</name>
							<description>input FIFO full flag</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>WR_OTHER_IF</name>
							<description>data are written to the flag bit</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA_IN_FIFO_EMPTY</name>
							<description>Whether DATA_IN_FIFO is empty</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_WR_DMA_START_ADDR_SLV</name>
					<description>DMA receive mode start address register</description>
					<addressOffset>0x188</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>WR_DMA_START_ADDR_SLV</name>
							<description>DMA receive mode start address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_WR_DMA_END_ADDR_SLV</name>
					<description>DMA receive mode end address register</description>
					<addressOffset>0x18C</addressOffset>
					<size>0x20</size>
					<resetValue>0x0003FFFF</resetValue>
					<fields>
						<field>
							<name>WR_DMA_START_ADDR_SLV</name>
							<description>DMA receive mode end address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_RD_DMA_START_ADDR_SLV</name>
					<description>DMA send mode start address register</description>
					<addressOffset>0x194</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RD_DMA_START_ADDR_SLV</name>
							<description>DMA send mode start address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_RD_DMA_END_ADDR_SLV</name>
					<description>DMA send mode end address register</description>
					<addressOffset>0x198</addressOffset>
					<size>0x20</size>
					<resetValue>0x0003FFFF</resetValue>
					<fields>
						<field>
							<name>RD_DMA_START_ADDR_SLV</name>
							<description>DMA send mode end address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_DMA_END_NOW_SLV</name>
					<description>DMA current address register</description>
					<addressOffset>0x19C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_NOW_ADDR_SLV</name>
							<description>DMA current address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
