Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
				<register>
					<name>R8_DMA_CMD0_SLV</name>
					<description>DMA mode command word0 register</description>
					<addressOffset>0x1A0</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>DMA_CMD0_SLV</name>
							<description>command word required to start DMA mode</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_DMA_CMD1_SLV</name>
					<description>DMA mode command word1 register</description>
					<addressOffset>0x1A1</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>DMA_CMD1_SLV</name>
							<description>command word required to start DMA mode</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLV_RESET_CMD</name>
					<description>DMA reset the command word register</description>
					<addressOffset>0x1A4</addressOffset>
					<size>0x8</size>
					<resetValue>0x05</resetValue>
					<fields>
						<field>
							<name>SLV_RESET_CMD</name>
							<description>A global reset is generated upon receipt of this command</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SLV_BUSY</name>
					<description>SLV busy flag register</description>
					<addressOffset>0x1A5</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SLV_BUSY</name>
							<description>SLV busy flag</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_OTHER_DATA</name>
					<description>Non-DMA writes to the data register</description>
					<addressOffset>0x1B0</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>OTHER_DATA</name>
							<description>Non-DMA writes to the data</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_DMA_DEC_LEN</name>
					<description>DMA parses length register</description>
					<addressOffset>0x1B4</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DMA_DEC_LEN</name>
							<description>parse the resulting DMA length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_DMA_DEC_OFFSET</name>
					<description>DMA resolves the offset address register</description>
					<addressOffset>0x1B6</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DMA_DEC_OFFSET</name>
							<description>Resolved DMA address offset</description>
							<bitRange>[15:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R32_PA_DIR</name>
					<description>GPIO PA I/O direction</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA_DIR</name>
							<description>GPIO PA I/O direction</description>
							<bitRange>[21:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PA_PIN</name>
					<description>GPIO PA input</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA_PIN</name>
							<description>GPIO PA input</description>
							<bitRange>[21:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PA_OUT</name>
					<description>GPIO PA output</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA_OUT</name>
							<description>GPIO PA output</description>
							<bitRange>[21:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PA_CLR</name>
					<description>GPIO PA clear output</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA_CLR</name>
							<description>GPIO PA clear output</description>
							<bitRange>[21:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PA_PU</name>
					<description>GPIO PA pullup resistance enable</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA_PU</name>
							<description>GPIO PA pullup resistance enable</description>
							<bitRange>[21:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PA_PD</name>
					<description>GPIO PA output open-drain_input pulldown resistance enable</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA_PD</name>
							<description>GPIO PA output open-drain_input pulldown resistance enable</description>
							<bitRange>[21:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PB_DIR</name>
					<description>GPIO PB I/O direction</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB_DM_DIR</name>
							<description>Pin current intput/output direction control domain</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>USB_DP_DIR</name>
							<description>Pin current intput/output direction control domain</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PB_DIR</name>
							<description>GPIO PB I/O direction</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PB_PIN</name>
					<description>GPIO PB input</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB_UDM_IN</name>
							<description>Pin intput level status</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>USB_UDP_IN</name>
							<description>Pin intput level status</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PB_PIN</name>
							<description>GPIO PB input level status</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PB_OUT</name>
					<description>GPIO PB output</description>
					<addressOffset>0xA8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB_UDM_OUT</name>
							<description>Pin output level status</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>USB_UDP_OUT</name>
							<description>Pin output level status</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PB_OUT</name>
							<description>GPIO PB output level status</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PB_CLR</name>
					<description>GPIO PB clear output</description>
					<addressOffset>0xAC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PB_CLR</name>
							<description>GPIO PB clear output</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PB_PU</name>
					<description>GPIO PB pullup resistance enable</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB_UDM_PU</name>
							<description>Pin pull-up function enable /close control bit</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>USB_UDP_PU</name>
							<description>Pin pull-up function enable /close control bit</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PB_PU</name>
							<description>GPIO PB pull-up resistance enable</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PB_PD</name>
					<description>GPIO PB output open-drain_input pulldown resistance enable</description>
					<addressOffset>0xB4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB_UDM_PD</name>
							<description>Pin function enable /close control bit</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>USB_UDP_PD</name>
							<description>Pin function enable /close control bit</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PB_PD</name>
							<description>GPIO PB output open-drain_input pulldown resistance enable</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PD_DIR</name>
					<description>GPIO PD I/O direction</description>
					<addressOffset>0xC0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_DIR</name>
							<description>GPIO PD I/O direction</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PD_PIN</name>
					<description>GPIO PD input</description>
					<addressOffset>0xC4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_PIN</name>
							<description>GPIO PD input</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PD_OUT</name>
					<description>GPIO PD output</description>
					<addressOffset>0xC8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_OUT</name>
							<description>GPIO PD output</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PD_PU</name>
					<description>GPIO PD pullup resistance enable</description>
					<addressOffset>0xD0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_PU</name>
							<description>GPIO PD pullup resistance enable</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_PD_PD</name>
					<description>GPIO PD output open-drain_input pulldown resistance enable</description>
					<addressOffset>0xD4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_PD</name>
							<description>GPIO PD output open-drain_input pulldown resistance enable</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_ADC_GPIO_MODE</name>
					<description>ADC port mode configuration register</description>
					<addressOffset>0x16E</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x7F</resetValue>
					<fields>
						<field>
							<name>ADC_GPIO_MODE</name>
							<description>ADC external channel input mode selection</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_STATUS_PA</name>
					<description>The interrupt status register at the PA port</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VIO_PWD_IF</name>
							<description>VIO power down interrupt flag bit</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>PA</name>
							<description>The interrupt status bit of the PA port</description>
							<bitRange>[21:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_ENABLE_PA</name>
					<description>The interrupt enable register at the PA port</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>The interrupt enable bit of the PA port</description>
							<bitRange>[21:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_MODE_PA</name>
					<description>The interrupt mode register at the PA port</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>The interrupt mode bit of the PA port</description>
							<bitRange>[21:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_POLAR_PA</name>
					<description>The interrupt polar register at the PA port</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>The interrupt polar bit of the PA port</description>
							<bitRange>[21:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_STATUS_PB</name>
					<description>The interrupt status register at the PB port</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PB</name>
							<description>The interrupt status bit of the PB port</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_ENABLE_PB</name>
					<description>The interrupt enable register at the PB port</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PB</name>
							<description>The interrupt enable bit of the PB port</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_MODE_PB</name>
					<description>The interrupt mode register at the PB port</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PB</name>
							<description>The interrupt mode bit of the PB port</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_POLAR_PB</name>
					<description>The interrupt polar register at the PB port</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PB</name>
							<description>The interrupt polar bit of the PB port</description>
							<bitRange>[22:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_STATUS_PD</name>
					<description>The interrupt status register at the PA port</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_24_31</name>
							<description>The interrupt status bit of the PD port</description>
							<bitRange>[31:24]</bitRange>
						</field>
						<field>
							<name>PD_0_7</name>
							<description>The interrupt status bit of the PD port</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_ENABLE_PD</name>
					<description>The interrupt enable register at the PD port</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_24_31</name>
							<description>The interrupt enable bit of the PD port</description>
							<bitRange>[31:24]</bitRange>
						</field>
						<field>
							<name>PD_0_7</name>
							<description>The interrupt enable bit of the PD port</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_MODE_PD</name>
					<description>The interrupt mode register at the PD port</description>
					<addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_24_31</name>
							<description>The interrupt mode bit of the PD port</description>
							<bitRange>[31:24]</bitRange>
						</field>
						<field>
							<name>PD_0_7</name>
							<description>The interrupt mode bit of the PD port</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_INT_POLAR_PD</name>
					<description>The interrupt polar register at the PD port</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD_24_31</name>
							<description>The interrupt polar bit of the PD port</description>
							<bitRange>[31:24]</bitRange>
						</field>
						<field>
							<name>PD_0_7</name>
							<description>The interrupt polar bit of the PD port</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_AFIO_PCFR1</name>
					<description>AF remap and debug I/O configuration register (AFIO_PCFR1)</description>
					<addressOffset>0x140</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LED_RM</name>
							<description>LINK LED remapping</description>
							<bitRange>[31:30]</bitRange>
						</field>
						<field>
							<name>SLV_RW_RM</name>
							<description>SLV remapping</description>
							<bitRange>[29:28]</bitRange>
						</field>
						<field>
							<name>SLV_DATA_RM</name>
							<description>SLV data remapping</description>
							<bitRange>[27:26]</bitRange>
						</field>
						<field>
							<name>SLV_ADDR1_RM</name>
							<description>SLV address1 remapping</description>
							<bitRange>[25:24]</bitRange>
						</field>
						<field>
							<name>SLV_ADDR_RM</name>
							<description>SLV command data selection input pin remapping</description>
							<bitRange>[23:22]</bitRange>
						</field>
						<field>
							<name>SLV_CS_RM</name>
							<description>SLV piece selection pin remapping</description>
							<bitRange>[21:20]</bitRange>
						</field>
						<field>
							<name>SLV_INTERRUPT_RM</name>
							<description>SLV interrupt pin remapping</description>
							<bitRange>[19:18]</bitRange>
						</field>
						<field>
							<name>I2C_RM</name>
							<description>I2C remapping</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>UART2_MODEM_RM</name>
							<description>UART2 MODEM remapping</description>
							<bitRange>[15:14]</bitRange>
						</field>
						<field>
							<name>UART1_MODEM_RM</name>
							<description>UART1 MODEM remapping</description>
							<bitRange>[13:12]</bitRange>
						</field>
						<field>
							<name>UART0_MODEM_RM</name>
							<description>UART0 MODEM remapping</description>
							<bitRange>[11:10]</bitRange>
						</field>
						<field>
							<name>UART3_RM</name>
							<description>UART3 remapping</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>UART2_RM</name>
							<description>UART2 remapping</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>UART1_RM</name>
							<description>UART1 remapping</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>UART0_RM</name>
							<description>UART0 remapping</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>SPI0_RM</name>
							<description>SPI0 remapping</description>
							<bitRange>[1:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_AFIO_PCFR2</name>
					<description>AF remap and debug I/O configuration register (AFIO_PCFR2)</description>
					<addressOffset>0x160</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UART3_MODEM</name>
							<description>UART3 MODEM remapping</description>
							<bitRange>[19:18]</bitRange>
						</field>
						<field>
							<name>TNOW3_RM</name>
							<description>TNOW3 remapping</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>TNOW2_RM</name>
							<description>TNOW2 remapping</description>
							<bitRange>[15:14]</bitRange>
						</field>
						<field>
							<name>TNOW1_RM</name>
							<description>TNOW1 remapping</description>
							<bitRange>[13:12]</bitRange>
						</field>
						<field>
							<name>TNOW0_RM</name>
							<description>TNOW0 remapping</description>
							<bitRange>[11:10]</bitRange>
						</field>
						<field>
							<name>SPI1_RM</name>
							<description>UART3 remapping</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>BUSY_RM</name>
							<description>BUSY remapping</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>TIMER1_RM</name>
							<description>TIMER1 remapping</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>TIMER0_RM</name>
							<description>TIMER0 remapping</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RST_RM</name>
							<description>reset pin remapping</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>ACT_LED_RM</name>
							<description>active led remapping</description>
							<bitRange>[1:0]</bitRange>
						</field>
					</fields>
				</register>
