Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
				<register>
					<name>R32_EXTEN_CTLR0</name>
					<description>Configure the extended control register 0</description>
					<addressOffset>0x144</addressOffset>
					<size>0x20</size>
					<resetValue>0x004BC061</resetValue>
					<fields>
						<field>
							<name>CORE_PROT_STATUS</name>
							<description>Core protected moed status bit</description>
							<bitRange>[30:30]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>ETH_PLL_RDY</name>
							<description>ETH PLL ready flag bit</description>
							<bitRange>[29:29]</bitRange>
							<access>read-only</access>
						</field>						
						<field>
							<name>USB_PLL_RDY</name>
							<description>USB PLL ready flag bit</description>
							<bitRange>[28:28]</bitRange>
							<access>read-only</access>
						</field>						
						<field>
							<name>CORE_HALT_INT_EN</name>
							<description>Kernel error interrupt enabled</description>
							<bitRange>[25:25]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RST_DLEAY_EN</name>
							<description>reset time extension control bit</description>
							<bitRange>[24:24]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>USBPLLON</name>
							<description>USBPLL clock enable bit</description>
							<bitRange>[22:22]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>FLASH_PRE_EN</name>
							<description>flash clock pre-divisor enable</description>
							<bitRange>[21:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ETHRST</name>
							<description>ethernet reset control</description>
							<bitRange>[19:19]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>DIG_ETH_PHY_RST</name>
							<description>ethernet phy digital module reset control</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ANA_ETH_PHY_RST</name>
							<description>ethernet phy analog module reset control</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>USBPLLMUL</name>
							<description>USBPLL input clock frequency multiplication factor</description>
							<bitRange>[15:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RST_CMD_EN</name>
							<description>global reset enabled</description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSY_EN</name>
							<description>the busy signal output of spi and slv enabled</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>TNOW3_EN</name>
							<description>the TNOW signal output of the UART3 is enabled</description>
							<bitRange>[11:11]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>TNOW2_EN</name>
							<description>the TNOW signal output of the UART2 is enabled</description>
							<bitRange>[10:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>TNOW1_EN</name>
							<description>the TNOW signal output of the UART1 is enabled</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>TNOW0_EN</name>
							<description>the TNOW signal output of the UART0 is enabled</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>SW</name>
							<description>select the systemitem clock source</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>USBPLLSRC</name>
							<description>USBPLL reference clock source</description>
							<bitRange>[6:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>SW_CFG</name>
							<description>Serial wire JTAG configuration</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_EXTEN_CTLR1</name>
					<description>Configure the extended control register 1</description>
					<addressOffset>0x154</addressOffset>
					<size>0x20</size>
					<resetValue>0x08124048</resetValue>
					<fields>
						<field>
							<name>VIO_PWN_INT_EN</name>
							<description>Enables an outage when the VIO power is down</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>VIO_PWN_RST_EN</name>
							<description>Enable system reset when the VIO power is down</description>
							<bitRange>[22:22]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>VIO_PWN_IO_EN</name>
							<description>Enable the IO port of the peripheral to input a high level
								when the VIO power is down</description>
							<bitRange>[21:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LDO_SLP_EN</name>
							<description>Enable the LDO to go into sleep mode when the VIO power is
								down</description>
							<bitRange>[20:20]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock signal selection</description>
							<bitRange>[19:19]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>HSE_STATUS</name>
							<description>External crystal current level status</description>
							<bitRange>[15:15]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>VIO_RDY</name>
							<description>VIO status</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>HSION</name>
							<description>Internal High Speed clock enable</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>HSEON</name>
							<description>External High Speed clock enable</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_EXTEN_CTLR2</name>
					<description>Configure the extended control register 2</description>
					<addressOffset>0x16C</addressOffset>
					<size>0x20</size>
					<resetValue>0x007F0010</resetValue>
					<fields>
						<field>
							<name>XIXO_GPIO_EN</name>
							<description>XI/XO pin open-drain_ouput control bit</description>
							<bitRange>[25:25]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>XO_OE</name>
							<description>XO ouput enable bit</description>
							<bitRange>[24:24]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>XI_OE</name>
							<description>XI ouput enable bit</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>USBPD_IN_HVT1</name>
							<description>PD PIN PB19 high threshold input mode</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>USBPD_IN_HVT0</name>
							<description>PD PIN PB18 high threshold input mode</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
