Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>TIMER3</name>
			<description>TMR3 register</description>
			<groupName>TMR3</groupName>
			<baseAddress>0x40408C00</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM3</name>
				<description>TIM3 Global interrupt</description>
				<value>23</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_TMR3_CTRL_MOD</name>
					<description>TMR3 mode control</description>
					<addressOffset>0x00</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_TMR_MODE_IN</name>
							<description>timer in mode</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_TMR_ALL_CLEAR</name>
							<description>force clear timer FIFO and count</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_TMR_COUNT_EN</name>
							<description>timer count enable</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_TMR_OUT_EN</name>
							<description>timer output enable</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_TMR_OUT_POLAR_RB_TMR_CAP_WIDTH</name>
							<description>timer PWM output polarity / Capture pulse width</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_TMR3_MODE_COUNT</name>
							<description>external clock counter mode</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_TMR_PWM_REPEAT_RB_TMR_CAP_EDGE</name>
							<description>timer PWM repeat mode / timer capture edge mode</description>
							<bitRange>[7:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_TMR3_INTER_EN</name>
					<description>TMR3 interrupt enable</description>
					<addressOffset>0x02</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_TMR_IE_CYC_END</name>
							<description>enable interrupt for timer capture count timeout or PWM
								cycle end</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IE_DATA_ACT</name>
							<description>enable interrupt for timer capture input action or PWM
								trigger</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IE_FIFO_HF</name>
							<description>enable interrupt for timer FIFO half (capture fifo >=4 or
								PWM fifo lower than3)</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IE_DMA_END</name>
							<description>enable interrupt for timer DMA completion</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IE_FIFO_OV</name>
							<description>enable interrupt for timer FIFO overflow</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IE_DMA_ERR</name>
							<description>enable DMA error responde interrupt</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_TMR3_FORCE_EN</name>
							<description>Forcibly enable TIMER0,TIMER1 and TIMER2 at the same time</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_TMR3_INT_FLAG</name>
					<description>TMR3 interrupt flag</description>
					<addressOffset>0x06</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_TMR_IF_CYC_END</name>
							<description>interrupt flag for timer capture count timeout or PWM cycle
								end</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IF_DATA_ACT</name>
							<description>interrupt flag for timer capture input action or PWM
								trigger</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IF_FIFO_HF</name>
							<description>interrupt flag for timer FIFO half</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IF_DMA_END</name>
							<description>interrupt flag for timer DMA completion</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IF_FIFO_OV</name>
							<description>interrupt flag for timer FIFO overflow</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_TMR_IF_DMA_ERR</name>
							<description>DMA error responde flag</description>
							<bitRange>[5:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_TMR3_FIFO_COUNT</name>
					<description>TMR3 FIFO count status</description>
					<addressOffset>0x07</addressOffset>
					<size>0x08</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TMR3_FIFO_COUNT</name>
							<description>TMR3 FIFO count status</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_TMR3_COUNT</name>
					<description>TMR3 current count</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TMR3_COUNT</name>
							<description>TMR3 current count</description>
							<bitRange>[27:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_TMR3_CNT_END</name>
					<description>TMR3 end count value, only low 28 bit</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TMR3_CNT_END</name>
							<description>The number of timer ticks in timer mode</description>
							<bitRange>[27:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_TMR3_FIFO</name>
					<description>TMR3 FIFO register, only low 28 bit</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TMR3_FIFO</name>
							<description>TMR3 FIFO current count</description>
							<bitRange>[27:0]</bitRange>
						</field>
					</fields>
				</register>
