Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>UART0</name>
			<description>UART0 register</description>
			<groupName>UART0</groupName>
			<baseAddress>0x4040D000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x800</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART0</name>
				<description>UART0 Global interrupt</description>
				<value>26</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_UART0_RBR_R8_UART0_THR_R8_UART0_DLL</name>
					<description>UART0 receiver buffer, receiving byte / UART0 transmitter holding,
						transmittal byte/DLL is low-byte,DLM is high-byte,together they from the baud rate divisor register</description>
					<addressOffset>0x00</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>R8_UART0_RBR__R8_UART0_THR_UART0_DLL</name>
							<description>UART receiver buffer, receiving byte
								/ UART transmitter holding, transmittal byte
								</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_IER__R8_UART0_DLM</name>
					<description>UART0 interrupt enable/baud rate divisor register,
						DLL is low-byte,DLM is high-byte,together they from the baud rate divisor register</description>
					<addressOffset>0x01</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_IER_RECV_RDY_UART0_DLM</name>
							<description>UART interrupt enable for receiver data ready</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_IER_THR_EMPTY_UART0_DLM</name>
							<description>UART interrupt enable for THR empty</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_IER_LINE_STAT_UART0_DLM</name>
							<description>UART interrupt enable for receiver line status</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_IER_MODEM_CHG_UART0_DLM</name>
							<description>UART0 interrupt enable for modem status change</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_IER_MODEM_IO_UART0_DLM</name>
							<description>serial modem MODEM signal pin selection bit</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_IER_MOUT_EN_UART0_DLM</name>
							<description>UART0 RTS/DTR output pin enable</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_IER_TXD_EN_UART0_DLM</name>
							<description>UART TXD pin enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_IER_RESET_UART0_DLM</name>
							<description>UART software reset control, high action, auto clear</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_IIR_R8_UART0_FCR</name>
					<description>UART0 interrupt identification/FIFO control register</description>
					<addressOffset>0x02</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x01</resetValue>
					<fields>
						<field>
							<name>RB_IIR_NO_INT_RB_FCR_FIFO_EN</name>
							<description>UART interrupt status flag/FIFO enable bit</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_IIR_INT_MASK_RB_FCR_RX_FIFO_CLR</name>
							<description>UART interrupt flag bit mask/clear UART receiver FIFO, high
								action, auto clear</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_IIR_INT_MASK_RB_FCR_TX_FIFO_CLR</name>
							<description>UART interrupt flag bit mask/clear UART transmitter FIFO,
								high action, auto clear</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_IIR_INT_MASK</name>
							<description>UART interrupt flag bit mask</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_IIR_FIFO_EN_RB_FCR_FIFO_TRIG</name>
							<description>UART FIFO enabled flag/UART receiver FIFO trigger level</description>
							<bitRange>[7:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_LCR</name>
					<description>UART0 line control</description>
					<addressOffset>0x03</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_LCR_WORD_SZ</name>
							<description>UART word bit length</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>RB_LCR_STOP_BIT</name>
							<description>UART stop bit length</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_LCR_PAR_EN</name>
							<description>UART parity enable</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_LCR_PAR_MOD</name>
							<description>UART parity mode</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>RB_LCR_BREAK_EN</name>
							<description>UART break control enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_LCR_DLAB</name>
							<description>UART divisor latch access enable bit</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_MCR</name>
					<description>UART0 modem control</description>
					<addressOffset>0x04</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_MCR_DTR</name>
							<description>UART0 control DTR output</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_MCR_RTS</name>
							<description>UART0 control RTS output</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_MCR_OUT1</name>
							<description>UART0 MODEM Control bit</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_MCR_OUT2</name>
							<description>UART interrupt required output control</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_MCR_LOOP</name>
							<description>UART0 enable local loop back</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_MCR_AU_FLOW_EN</name>
							<description>UART0 enable autoflow control</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_MCR_TNOW</name>
							<description>UART0 enable TNOW output on DTR pin</description>
							<bitRange>[6:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_LSR</name>
					<description>UART0 line status</description>
					<addressOffset>0x05</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0xC0</resetValue>
					<fields>
						<field>
							<name>RB_LSR_DATA_RDY</name>
							<description>UART receiver fifo data ready status</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_LSR_OVER_ERR</name>
							<description>UART receiver overrun error</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_LSR_PAR_ERR</name>
							<description>UART receiver frame error</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_LSR_FRAME_ERR</name>
							<description>UART receiver frame error</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_LSR_BREAK_ERR</name>
							<description>UART receiver break error</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_LSR_TX_FIFO_EMP</name>
							<description>UART transmitter fifo empty status</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_LSR_TX_ALL_EMP</name>
							<description>UART transmitter all empty status</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_LSR_ERR_RX_FIFO</name>
							<description>indicate error in UART receiver fifo</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_MSR</name>
					<description>UART0 modem status</description>
					<addressOffset>0x06</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_MSR_CTS_CHG</name>
							<description>UART0 CTS changed status, high action</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_MSR_DSR_CHG</name>
							<description>UART0 DSR changed status, high action</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_MSR_RI_CHG</name>
							<description>UART0 RI changed status, high action</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_MSR_DCD_CHG</name>
							<description>UART0 DCD changed status, high action</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_MSR_CTS</name>
							<description>UART0 CTS action status</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_MSR_DSR</name>
							<description>UART0 DSR action status</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_MSR_RI</name>
							<description>UART0 RI action status</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_MSR_DCD</name>
							<description>UART0 DCD action status</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_DIV</name>
					<description>UART0 pre-frequency divisiono register</description>
					<addressOffset>0x07</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>UART0_DIV</name>
							<description>System clock is pre-divided after frequency doubling to
								generate the internal reference clock of the serial port</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_DMA_CTRL</name>
					<description>DMA Control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DMA_WR_EN</name>
							<description>DMA enabled when receiving data</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_DMA_WR_LOOP_EN</name>
							<description>DMA loop mode enabled when receiving data</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_DMA_WR_END_EN</name>
							<description>the end of DMA interrupt when receiving data is enabled</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_DMA_WR_ERR_EN</name>
							<description>DMA data transfer error interrupt when receiving data is
								enabled</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_DMA_RD_EN</name>
							<description>DMA enabled when sending data</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_DMA_RD_LOOP_EN</name>
							<description>DMA loop mode enabled when sending data</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_DMA_RD_END_EN</name>
							<description>the end of DMA interrupt when sending data is enabled</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_DMA_RD_ERR_EN</name>
							<description>DMA data transfer error interrupt when sending data is
								enabled</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART0_DMA_IF</name>
					<description>DMA status register</description>
					<addressOffset>0x09</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DMA_IF_TX_ERR</name>
							<description>DMA transfer error flag while sending data</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_DMA_IF_TX_END</name>
							<description>DMA end flag when data is sended</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_DMA_IF_RX_ERR</name>
							<description>DMA transfer error flag while receiving data</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_DMA_IF_RX_END</name>
							<description>DMA end flag when data is received</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART0_DMA_WR_NOW_ADDR</name>
					<description>DMA receive mode current address register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_NOW_ADDR</name>
							<description>DMA receive mode current address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART0_DMA_WR_START_ADDR</name>
					<description>DMA receive mode start address register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_START_ADDR</name>
							<description>DMA receive mode start address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART0_DMA_WR_END_ADDR</name>
					<description>DMA received mode end address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_END_ADDR</name>
							<description>DMA receivek mode end address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART0_DMA_RD_NOW_ADDR</name>
					<description>DMA send mode current address register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_RD_ADDR</name>
							<description>DMA send mode current address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART0_DMA_RD_START_ADDR</name>
					<description>DMA send mode start address register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_RD_START_ADDR</name>
							<description>DMA send mode start address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART0_DMA_RD_END_ADDR</name>
					<description>DMA send mode end address register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_RD_END_ADDR</name>
							<description>DMA send mode end address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
