Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>UART1</name>
			<description>UART1 register</description>
			<groupName>UART1</groupName>
			<baseAddress>0x4040D800</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x800</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1</name>
				<description>UART1 Global interrupt</description>
				<value>27</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_UART1_RBR_R8_UART1_THR_R8_UART1_DLL</name>
					<description>UART1 receiver buffer, receiving byte / UART1 transmitter holding,
						transmittal byte/DLL is low-byte,DLM is high-byte,together they from the baud rate divisor register</description>
					<addressOffset>0x00</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>R8_UART1_RBR_R8_UART1_THR_UART1_DLL</name>
							<description>UART receiver buffer, receiving byte
								/ UART transmitter holding, transmittal byte</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_IER_R8_UART1_DLM</name>
					<description>UART1 interrupt enable/baud rate divisor register,
						DLL is low-byte,DLM is high-byte,together they from the baud rate divisor
						register</description>
					<addressOffset>0x01</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_IER_RECV_RDY_UART1_DLM</name>
							<description>UART interrupt enable for receiver data ready</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_IER_THR_EMPTY_UART1_DLL_UART1_DLM</name>
							<description>UART interrupt enable for THR empty</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_IER_LINE_STAT_UART1_DLL_UART1_DLM</name>
							<description>UART interrupt enable for receiver line status</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_IER_MODEM_CHG_UART1_DLL_UART1_DLM</name>
							<description>UART1 interrupt enable for modem status change</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_IER_MODEM_IO_UART1_DLL_UART1_DLM</name>
							<description>serial modem MODEM signal pin selection bit</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_IER_MOUT_EN_UART1_DLL_UART1_DLM</name>
							<description>UART1 RTS/DTR output pin enable</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_IER_TXD_EN_UART1_DLL_UART1_DLM</name>
							<description>UART TXD pin enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_IER_RESET_UART1_DLL_UART1_DLM</name>
							<description>UART software reset control, high action, auto clear</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_IIR_R8_UART1_FCR</name>
					<description>UART1 interrupt identification/FIFO control register</description>
					<addressOffset>0x02</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x01</resetValue>
					<fields>
						<field>
							<name>RB_IIR_NO_INT_RB_FCR_FIFO_EN</name>
							<description>UART interrupt status flag/FIFO enable bit</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_IIR_INT_MASK_RB_FCR_RX_FIFO_CLR</name>
							<description>UART interrupt flag bit mask/clear UART receiver FIFO, high
								action, auto clear</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_IIR_INT_MASK_RB_FCR_TX_FIFO_CLR</name>
							<description>UART interrupt flag bit mask/clear UART transmitter FIFO,
								high action, auto clear</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_IIR_INT_MASK</name>
							<description>UART interrupt flag bit mask</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_IIR_FIFO_EN_RB_FCR_FIFO_TRIG</name>
							<description>UART FIFO enabled flag/UART receiver FIFO trigger level</description>
							<bitRange>[7:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_LCR</name>
					<description>UART1 line control</description>
					<addressOffset>0x03</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_LCR_WORD_SZ</name>
							<description>UART word bit length</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>RB_LCR_STOP_BIT</name>
							<description>UART stop bit length</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_LCR_PAR_EN</name>
							<description>UART parity enable</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_LCR_PAR_MOD</name>
							<description>UART parity mode</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>RB_LCR_BREAK_EN</name>
							<description>UART break control enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_LCR_DLAB</name>
							<description>UART divisor latch access enable bit</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_MCR</name>
					<description>UART1 modem control</description>
					<addressOffset>0x04</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_MCR_RTS</name>
							<description>UART1 control RTS output</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_MCR_OUT2</name>
							<description>UART interrupt required output control</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_MCR_AU_FLOW_EN</name>
							<description>UART1 enable autoflow control</description>
							<bitRange>[5:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_LSR</name>
					<description>UART1 line status</description>
					<addressOffset>0x05</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0xC0</resetValue>
					<fields>
						<field>
							<name>RB_LSR_DATA_RDY</name>
							<description>UART receiver fifo data ready status</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_LSR_OVER_ERR</name>
							<description>UART receiver overrun error</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_LSR_PAR_ERR</name>
							<description>UART receiver frame error</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_LSR_FRAME_ERR</name>
							<description>UART receiver frame error</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_LSR_BREAK_ERR</name>
							<description>UART receiver break error</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_LSR_TX_FIFO_EMP</name>
							<description>UART transmitter fifo empty status</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_LSR_TX_ALL_EMP</name>
							<description>UART transmitter all empty status</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_LSR_ERR_RX_FIFO</name>
							<description>indicate error in UART receiver fifo</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_MSR</name>
					<description>UART1 modem status</description>
					<addressOffset>0x06</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_MSR_CTS_CHG</name>
							<description>UART1 CTS changed status, high action</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_MSR_CTS</name>
							<description>UART1 CTS action status</description>
							<bitRange>[4:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_DIV</name>
					<description>UART1 pre-frequency divisiono register</description>
					<addressOffset>0x07</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>UART1_DIV</name>
							<description>System clock is pre-divided after frequency doubling to
								generate the internal reference clock of the serial port</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_DMA_CTRL</name>
					<description>DMA Control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DMA_RD_EN</name>
							<description>DMA enabled when receiving data</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_DMA_RD_LOOP_EN</name>
							<description>DMA loop mode enabled when receiving data</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_DMA_RD_END_EN</name>
							<description>the end of DMA interrupt when receiving data is enabled</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_DMA_WR_EN</name>
							<description>DMA enabled when sending data</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_DMA_WR_LOOP_EN</name>
							<description>DMA loop mode enabled when sending data</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_DMA_WR_END_EN</name>
							<description>the end of DMA interrupt when sending data is enabled</description>
							<bitRange>[6:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UART1_DMA_IF</name>
					<description>DMA status register</description>
					<addressOffset>0x09</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DMA_PAR_ERR</name>
							<description>PARITY error flag bit in DMA mode</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_DMA_IF_TX_END</name>
							<description>DMA end flag when data is sended</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_DMA_FRAME_ERR</name>
							<description>FRAME error flag bit in DMA mode</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_DMA_IF_RX_END</name>
							<description>DMA end flag when data is received</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART1_DMA_WR_NOW_ADDR</name>
					<description>DMA receive mode current address register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_NOW_ADDR</name>
							<description>DMA receive mode current address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART1_DMA_WR_START_ADDR</name>
					<description>DMA receive mode start address register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_START_ADDR</name>
							<description>DMA receive mode start address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART1_DMA_WR_END_ADDR</name>
					<description>DMA received mode end address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_END_ADDR</name>
							<description>DMA receivek mode end address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART1_DMA_RD_NOW_ADDR</name>
					<description>DMA send mode current address register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_WR_RD_ADDR</name>
							<description>DMA send mode current address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART1_DMA_RD_START_ADDR</name>
					<description>DMA send mode start address register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_RD_START_ADDR</name>
							<description>DMA send mode start address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UART1_DMA_RD_END_ADDR</name>
					<description>DMA send mode end address register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_RD_END_ADDR</name>
							<description>DMA send mode end address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
