Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>

		<peripheral derivedFrom="UART1">
			<name>UART2</name>
			<description>UART2 register</description>
			<groupName>UART2</groupName>
			<baseAddress>0x40409000</baseAddress>
			<interrupt>
				<name>UART2</name>
				<description>UART2 Global interrupt</description>
				<value>35</value>
			</interrupt>
		</peripheral>

		<peripheral derivedFrom="UART1">
			<name>UART3</name>
			<description>UART3 register</description>
			<groupName>UART3</groupName>
			<baseAddress>0x40409800</baseAddress>
			<interrupt>
				<name>UART3</name>
				<description>UART3 Global interrupt</description>
				<value>36</value>
			</interrupt>
		</peripheral>

		<peripheral>
			<name>SPI0</name>
			<description>SPI0 register</description>
			<groupName>SPI0</groupName>
			<baseAddress>0x4040C000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x800</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI0</name>
				<description>SPI0 global interrupt</description>
				<value>24</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_SPI0_CTRL_MOD</name>
					<description>SPI0 mode control</description>
					<addressOffset>0x00</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x02</resetValue>
					<fields>
						<field>
							<name>RB_SPI_MODE_SLAVE</name>
							<description>SPI slave mode</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_SPI_ALL_CLEAR</name>
							<description>force clear SPI FIFO and count</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SPI_2WIRE_MOD</name>
							<description>SPI enable 2 wire mode</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_SPI_MST_SCK_MOD__RB_SPI_SLV_CMD_MOD</name>
							<description>SPI master clock mode _ SPI slave command mode</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_SPI_FIFO_DIR</name>
							<description>SPI FIFO direction</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SPI_SCK_OE</name>
							<description>SPI SCK output enable</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_SPI_MOSI_OE</name>
							<description>SPI MOSI output enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_SPI_MISO_OE</name>
							<description>SPI MISO output enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_CTRL_DMA</name>
					<description>SPI0 DMA control</description>
					<addressOffset>0x01</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_DMA_ENABLE</name>
							<description>SPI DMA enable</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_SPI_DMA_BURST</name>
							<description>DMA block operates on the enable bit</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SPI_DMA_LOOP</name>
							<description>SPI DMA address loop enable</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_SPI_HS_HOST</name>
							<description>High speed host receive mode control bit</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_INTER_EN</name>
					<description>SPI0 interrupt enable</description>
					<addressOffset>0x02</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_IE_CNT_END</name>
							<description>enable interrupt for SPI total byte count end</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_BYTE_END</name>
							<description>enable interrupt for SPI single byte exchanged</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_FIFO_HF</name>
							<description>enable interrupt for SPI FIFO half</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_DMA_END</name>
							<description>enable interrupt for SPI DMA completion</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_FIFO_OV</name>
							<description>enable interrupt for SPI FIFO overflow</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_DMA_ERR</name>
							<description>enable interrupt for DMA transfer error</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_FST_BYTE</name>
							<description>enable interrupt for SPI slave mode first byte received</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_CLOCK_DIV_R8_SPI0_SLAVE_PRE</name>
					<description>SPI0 master clock divisor / SPI0 slave preset value</description>
					<addressOffset>0x03</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x10</resetValue>
					<fields>
						<field>
							<name>SPI0_CLOCK_DIV_SPI0_SLAVE_PRE</name>
							<description>master clock divisor / SPI0 slave preset value</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_BUFFER</name>
					<description>SPI0 data buffer</description>
					<addressOffset>0x04</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI0_BUFFER</name>
							<description>SPI data buffer</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_RUN_FLAG</name>
					<description>SPI0 work flag</description>
					<addressOffset>0x05</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_SLV_CMD_ACT</name>
							<description>SPI slave command flag</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SPI_FIFO_READY</name>
							<description>SPI FIFO ready status</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_SPI_SLV_CS_LOAD</name>
							<description>SPI slave chip-select loading status</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_SPI_SLV_SELECT</name>
							<description>SPI slave selection status</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_INT_FLAG</name>
					<description>SPI0 interrupt flag</description>
					<addressOffset>0x06</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_IF_CNT_END</name>
							<description>interrupt flag for SPI total byte count end</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SPI_IF_BYTE_END</name>
							<description>interrupt flag for SPI byte exchanged</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SPI_IF_FIFO_HF</name>
							<description>interrupt flag for SPI FIFO half</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SPI_IF_DMA_END</name>
							<description>interrupt flag for SPI DMA completion</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SPI_IF_FIFO_OV</name>
							<description>interrupt flag for SPI FIFO overflow</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SPI_IF_DMA_ERR</name>
							<description>interrupt flag for SPI DMA transfer error </description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SPI_FREE</name>
							<description>current SPI free status</description>
							<bitRange>[6:6]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_SPI_IF_FST_BYTE</name>
							<description>interrupt flag for SPI slave mode first byte received</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_FIFO_COUNT</name>
					<description>SPI0 FIFO count status</description>
					<addressOffset>0x07</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI0_FIFO_COUNT</name>
							<description>SPI FIFO count status</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_RESET_CMD</name>
					<description>SPI0 reset command word register</description>
					<addressOffset>0x08</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI0_RESET_CMD</name>
							<description>A global reset is generated when this command is received</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_BUSY</name>
					<description>SPI0 busy flag register</description>
					<addressOffset>0x09</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI0_BUSY</name>
							<description>busy flag bit</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_SPI0_TOTAL_CNT</name>
					<description>SPI0 total byte count, only low 12 bit</description>
					<addressOffset>0x0C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SPI0_TOTAL_CNT</name>
							<description>SPI total byte count, only low 12 bit</description>
							<bitRange>[11:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_FIFO</name>
					<description>SPI0 FIFO register</description>
					<addressOffset>0x10</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI0_FIFO</name>
							<description>SPI FIFO register</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI0_FIFO_COUNT1</name>
					<description>SPI0 FIFO count status</description>
					<addressOffset>0x13</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI0_FIFO_COUNT1</name>
							<description>SPI FIFO count statu</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_SPI0_DMA_NOW</name>
					<description>SPI0 DMA current address</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI0_DMA_NOW</name>
							<description>SPI DMA current address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_SPI0_DMA_BEG</name>
					<description>SPI0 DMA begin address</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI0_DMA_BEG</name>
							<description>SPI DMA begin address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_SPI0_DMA_END</name>
					<description>SPI0 DMA end address</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI0_DMA_END</name>
							<description>SPI DMA end address</description>
							<bitRange>[17:0]</bitRange>
						</field>
					</fields>
				</register>
