Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SPI1</name>
			<description>SPI1 register</description>
			<groupName>SPI1</groupName>
			<baseAddress>0x4040C800</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x800</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI1</name>
				<description>SPI1 global interrupt</description>
				<value>25</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_SPI1_CTRL_MOD</name>
					<description>SPI1 mode control</description>
					<addressOffset>0x00</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x02</resetValue>
					<fields>
						<field>
							<name>RB_SPI_ALL_CLEAR</name>
							<description>force clear SPI FIFO and count</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SPI_SLV_CMD_MOD</name>
							<description>SPI slave command mode</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_SPI_FIFO_DIR</name>
							<description>SPI FIFO direction</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SPI_SCK_OE</name>
							<description>SPI SCK output enable</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_SPI_MOSI_OE</name>
							<description>SPI MOSI output enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_SPI_MISO_OE</name>
							<description>SPI 2 wire or 3 wire SPI mode configuration bits</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_CTRL_DMA</name>
					<description>SPI1 DMA control</description>
					<addressOffset>0x01</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_HS_HOST</name>
							<description>High speed host receive mode control bit</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_INTER_EN</name>
					<description>SPI1 interrupt enable</description>
					<addressOffset>0x02</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_IE_CNT_END</name>
							<description>enable interrupt for SPI total byte count end</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_BYTE_END</name>
							<description>enable interrupt for SPI single byte exchanged</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_FIFO_HF</name>
							<description>enable interrupt for SPI FIFO half</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IE_FIFO_OV</name>
							<description>enable interrupt for SPI FIFO overflow</description>
							<bitRange>[4:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_CLOCK_DIV</name>
					<description>SPI1 master clock divisor</description>
					<addressOffset>0x03</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x02</resetValue>
					<fields>
						<field>
							<name>SPI1_CLOCK_DIV</name>
							<description>master clock divisor</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_BUFFER</name>
					<description>SPI1 data buffer</description>
					<addressOffset>0x04</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI1_BUFFER</name>
							<description>SPI data buffer</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_RUN_FLAG</name>
					<description>SPI1 work flag</description>
					<addressOffset>0x05</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_FIFO_READY</name>
							<description>SPI FIFO ready status</description>
							<bitRange>[5:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_INT_FLAG</name>
					<description>SPI1 interrupt flag</description>
					<addressOffset>0x06</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SPI_IF_CNT_END</name>
							<description>interrupt flag for SPI total byte count end</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IF_BYTE_END</name>
							<description>interrupt flag for SPI byte exchanged</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IF_FIFO_HF</name>
							<description>interrupt flag for SPI FIFO half</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_SPI_IF_FIFO_OV</name>
							<description>interrupt flag for SPI FIFO overflow</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SPI_FREE</name>
							<description>current SPI free status</description>
							<bitRange>[6:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_FIFO_COUNT</name>
					<description>SPI1 FIFO count status</description>
					<addressOffset>0x07</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI1_FIFO_COUNT</name>
							<description>SPI FIFO count status</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_SPI1_TOTAL_CNT</name>
					<description>SPI1 total byte count, only low 12 bit</description>
					<addressOffset>0x0C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SPI1_TOTAL_CNT</name>
							<description>SPI total byte count, only low 12 bit</description>
							<bitRange>[11:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_FIFO</name>
					<description>SPI1 FIFO register</description>
					<addressOffset>0x10</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SPI1_FIFO</name>
							<description>SPI FIFO register</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_SPI1_FIFO_COUNT1</name>
					<description>SPI1 FIFO count status</description>
					<addressOffset>0x13</addressOffset>
					<size>8</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>R8_SPI1_FIFO_COUNT1</name>
							<description>SPI FIFO count statu</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
