Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC</name>
			<description>ADC register</description>
			<groupName>ADC</groupName>
			<baseAddress>0x4040A000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC</name>
				<description>ADC global interrupt</description>
				<value>31</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_ADC_CTRL_MOD</name>
					<description>ADC mode control register</description>
					<addressOffset>0x00</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_ADC_POWER_ON</name>
							<description>ADC function enable</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_SAMPLE_WID</name>
							<description>ADC automatically samples the pulse width settings bit</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_CHAN_MOD</name>
							<description>ADC channel selection bit</description>
							<bitRange>[5:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_CYCLE_CLK</name>
							<description>ADC clock sampling mode setting bit</description>
							<bitRange>[3:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_ADC_CTRL_DMA</name>
					<description>DMA control register</description>
					<addressOffset>0x01</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_ADC_MAN_SAMPLE</name>
							<description>ADC manually sampled the control bits</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_CHAN_OE</name>
							<description>ADC channel controls the ADCS output enable bits</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_DMA_LOOP</name>
							<description>DMA address loop function enables</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_DMA_BURST</name>
							<description>DMA block operation enable bit</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_DMA_ENABLE</name>
							<description>DMA function enable bit</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_ADC_INTER_EN</name>
					<description>ADC interrupt the enabling register</description>
					<addressOffset>0x02</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_ADC_CMP_MOD_GT</name>
							<description>ADC reference size to compare enable bits</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_CMP_MOD_EQ</name>
							<description>ADC reference value equal comparable enable bits</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IE_DMA_ERR</name>
							<description>DMA transfer process error response interrupt enable bits</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IE_FIFO_OV</name>
							<description>FIFO overflow interruption enable bits</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IE_DMA_END</name>
							<description>DMA ends the interrupt enable bits</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IE_FIFO_HF</name>
							<description>FIFO receives half interrupt enable bits</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IE_ADC_END</name>
							<description>ADC conversion complete interrupt enable bits</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IE_ADC_CMP</name>
							<description>current ADC comparison activates the interrupt enable bits</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_ADC_CLOCK_DIV</name>
					<description>ADC clock frequency partition coefficient register</description>
					<addressOffset>0x03</addressOffset>
					<size>8</size>
					<resetValue>0x10</resetValue>
					<fields>
						<field>
							<name>ADC_CLOCK_DIV</name>
							<description>sampling the clock frequency division coefficient</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_ADC_DATA</name>
					<description>Convert the data register</description>
					<addressOffset>0x04</addressOffset>
					<size>16</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>ADC_DATA</name>
							<description>ADC collected the data content</description>
							<bitRange>[11:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_ADC_INT_FLAG</name>
					<description>Interrupt the status register</description>
					<addressOffset>0x06</addressOffset>
					<size>8</size>
					<resetValue>0x40</resetValue>
					<fields>
						<field>
							<name>RB_ADC_CHAN_INDEX</name>
							<description>The ADC current channel in autoconversion mode</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_ADC_EOC_FLAG</name>
							<description>The ADC transition-end state bit</description>
							<bitRange>[6:6]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_ADC_IF_DMA_ERR</name>
							<description>DMA transfer error interrupt flag bit</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IF_FIFO_OV</name>
							<description>FIFO overflow interrupt flag bit</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IF_DMA_END</name>
							<description>DMA end flag bit</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IF_FIFO_HF</name>
							<description>FIFO receives half interrupt flag bit</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IF_ADC_END</name>
							<description>The ADC transition-end flag bit</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ADC_IF_ADC_CMP</name>
							<description>ADC activated interrupt flag bits comparing the ADC current
								value with the reference</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_ADC_FIFO_COUNT</name>
					<description>FIFO count register</description>
					<addressOffset>0x07</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>ADC_FIFO_COUNT</name>
							<description>number of ADC converted data already stored in the FIFO</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ADC_CTRL</name>
					<description>ADC control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADC_CTL_MOD1</name>
							<description>Corresponding channel</description>
							<bitRange>[3:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC_SMAPLE_TIME</name>
							<description>ADC sampling and calibration time</description>
							<bitRange>[24:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC_CYCLE_BIT_4_6</name>
							<description>Position 4-6 of the automatic sampling period</description>
							<bitRange>[27:25]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC_BIT_MODE</name>
							<description>ADC resolution selection bit</description>
							<bitRange>[28:28]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_ADC_CMP_VALUE</name>
					<description>The comparison mode reference value register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ADC_CMP_VALUE</name>
							<description>The comparison mode reference value</description>
							<bitRange>[11:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_ADC_FIFO</name>
					<description>ADC FIFO register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ADC_FIFO</name>
							<description>ADC Current conversion value</description>
							<bitRange>[11:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ADC_DMA_NOW</name>
					<description>DMA current buffer address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADC_DMA_NOW</name>
							<description>DMA current buffer address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ADC_DMA_BEG</name>
					<description>DMA start buffer address register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADC_DMA_BEG</name>
							<description>DMA start buffer address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_ADC_DMA_END</name>
					<description>DMA end buffer address register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>R32_ADC_DMA_END</name>
							<description>DMA end buffer address</description>
							<bitRange>[17:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
