Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
				<register>
					<name>IPRIOR27</name>
					<displayName>IPRIOR27</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x41B</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR28</name>
					<displayName>IPRIOR28</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x41C</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR29</name>
					<displayName>IPRIOR29</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x41D</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>

				<register>
					<name>IPRIOR30</name>
					<displayName>IPRIOR30</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x41E</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR31</name>
					<displayName>IPRIOR31</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x41F</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR32</name>
					<displayName>IPRIOR32</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x420</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR33</name>
					<displayName>IPRIOR33</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x421</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR34</name>
					<displayName>IPRIOR34</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x422</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR35</name>
					<displayName>IPRIOR35</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x423</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR36</name>
					<displayName>IPRIOR36</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x424</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR37</name>
					<displayName>IPRIOR37</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x425</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR38</name>
					<displayName>IPRIOR38</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x426</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR39</name>
					<displayName>IPRIOR39</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x427</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>

				<register>
					<name>IPRIOR40</name>
					<displayName>IPRIOR40</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x428</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR41</name>
					<displayName>IPRIOR41</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x429</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR42</name>
					<displayName>IPRIOR42</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x42A</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR43</name>
					<displayName>IPRIOR43</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x42B</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR44</name>
					<displayName>IPRIOR44</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x42C</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR45</name>
					<displayName>IPRIOR45</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x42D</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR46</name>
					<displayName>IPRIOR46</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x42E</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR47</name>
					<displayName>IPRIOR47</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x42F</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR48</name>
					<displayName>IPRIOR48</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x430</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR49</name>
					<displayName>IPRIOR49</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x431</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>

				<register>
					<name>IPRIOR50</name>
					<displayName>IPRIOR50</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x432</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR51</name>
					<displayName>IPRIOR51</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x433</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR52</name>
					<displayName>IPRIOR52</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x434</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR53</name>
					<displayName>IPRIOR53</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x435</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR54</name>
					<displayName>IPRIOR54</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x436</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR55</name>
					<displayName>IPRIOR55</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x437</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR56</name>
					<displayName>IPRIOR56</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x438</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR57</name>
					<displayName>IPRIOR57</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x439</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR58</name>
					<displayName>IPRIOR58</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43A</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR59</name>
					<displayName>IPRIOR59</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43B</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>

				<register>
					<name>IPRIOR60</name>
					<displayName>IPRIOR60</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43C</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR61</name>
					<displayName>IPRIOR61</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43D</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR62</name>
					<displayName>IPRIOR62</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43E</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR63</name>
					<displayName>IPRIOR63</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43F</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR64</name>
					<displayName>IPRIOR64</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x440</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR65</name>
					<displayName>IPRIOR65</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x441</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR66</name>
					<displayName>IPRIOR66</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x442</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR67</name>
					<displayName>IPRIOR67</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x443</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>IPRIOR68</name>
					<displayName>IPRIOR68</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x444</addressOffset>
					<size>0x8</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>SCTLR</name>
					<displayName>SCTLR</displayName>
					<description>System Control Register</description>
					<addressOffset>0xd10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SLEEPONEXIT</name>
							<description>SLEEPONEXIT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLEEPDEEP</name>
							<description>SLEEPDEEP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFITOWFE</name>
							<description>WFITOWFE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEVONPEND</name>
							<description>SEVONPEND</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETEVENT</name>
							<description>SETEVENT</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LOCKUP</name>
							<description>Lock_up</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYSRESET</name>
							<description>SYSRESET</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CTLR</name>
					<displayName>STK_CTLR</displayName>
					<description>System counter control register</description>
					<addressOffset>0x1000</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STE</name>
							<description>System counter enable</description>
							<access>read-write</access>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STIE</name>
							<description>System counter interrupt enable</description>
							<access>read-write</access>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STCLK</name>
							<description>System selects the clock source</description>
							<access>read-write</access>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STRE</name>
							<description>System reload register</description>
							<access>read-write</access>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>System Mode</description>
							<access>read-write</access>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INIT</name>
							<description>System Initialization update</description>
							<access>read-write</access>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWIE</name>
							<description>System software triggered interrupts enable</description>
							<access>read-write</access>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_SR</name>
					<description>System START</description>
					<addressOffset>0x1004</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNTIF</name>
							<description>CNTIF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CNTL</name>
					<description>System counter low register</description>
					<addressOffset>0x1008</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNTL</name>
							<description>CNTL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CNTH</name>
					<description>System counter high register</description>
					<addressOffset>0x100C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNTH</name>
							<description>CNTH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CMPLR</name>
					<description>System compare low register</description>
					<addressOffset>0x1010</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMPL</name>
							<description>CMPL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STK_CMPHR</name>
					<description>System compare high register</description>
					<addressOffset>0x1014</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMPH</name>
							<description>CMPH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
