Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ETHERNET_MAC</name>
			<description>Ethernet: media access control</description>
			<groupName>ETHERNET</groupName>
			<baseAddress>0x40028000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0XFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ETH</name>
				<description>Ethernet global interrupt</description>
				<value>18</value>
			</interrupt>
			<interrupt>
				<name>ETHWakeUP</name>
				<description>Ethernet Wakeup through EXTI line
					interrupt</description>
				<value>37</value>
			</interrupt>
			<registers>
				<register>
					<name>MACCR</name>
					<displayName>MACCR</displayName>
					<description>Ethernet MAC configuration register
						(ETH_MACCR)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RE</name>
							<description>Receiver enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE</name>
							<description>Transmitter enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>APCS</name>
							<description>Automatic pad/CRC
								stripping</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RD</name>
							<description>Retry disable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IPCO</name>
							<description>IPv4 checksum offload</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DM</name>
							<description>Duplex mode</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FES</name>
							<description>Fast Ethernet speed</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IFG</name>
							<description>Interframe gap</description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>JD</name>
							<description>Jabber disable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WD</name>
							<description>Watchdog disable</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACFFR</name>
					<displayName>MACFFR</displayName>
					<description>Ethernet MAC frame filter register
						(ETH_MACCFFR)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PM</name>
							<description>Promiscuous mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HU</name>
							<description>Hash unicast</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HM</name>
							<description>Hash multicast</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAIF</name>
							<description>Destination address inverse
								filtering</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAM</name>
							<description>Pass all multicast</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BFD</name>
							<description>Broadcast frames disable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PCF</name>
							<description>Pass control frames</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SAIF</name>
							<description>Source address inverse
								filtering</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAF</name>
							<description>Source address filter</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HPF</name>
							<description>Hash or perfect filter</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RA</name>
							<description>Receive all</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACHTHR</name>
					<displayName>MACHTHR</displayName>
					<description>Ethernet MAC hash table high
						register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HTH</name>
							<description>Hash table high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACHTLR</name>
					<displayName>MACHTLR</displayName>
					<description>Ethernet MAC hash table low
						register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HTL</name>
							<description>Hash table low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACMIIAR</name>
					<displayName>MACMIIAR</displayName>
					<description>Ethernet MAC MII address register
						(ETH_MACMIIAR)</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MB</name>
							<description>MII busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MW</name>
							<description>MII write</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CR</name>
							<description>Clock range</description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MR</name>
							<description>MII register</description>
							<bitOffset>6</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>PA</name>
							<description>PHY address</description>
							<bitOffset>11</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACMIIDR</name>
					<displayName>MACMIIDR</displayName>
					<description>Ethernet MAC MII data register
						(ETH_MACMIIDR)</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD</name>
							<description>MII data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACFCR</name>
					<displayName>MACFCR</displayName>
					<description>Ethernet MAC flow control register
						(ETH_MACFCR)</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FCB</name>
							<description>Flow control busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TFCE</name>
							<description>Transmit flow control
								enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RFCE</name>
							<description>Receive flow control
								enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPFD</name>
							<description>Unicast pause frame detect</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PT</name>
							<description>Pass control frames</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACVLAN</name>
					<displayName>MACVLAN</displayName>
					<description>Ethernet MAC VLAN tag register
						(ETH_MACVLAN)</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VLANTI</name>
							<description>VLAN tag identifier (for receive
								frames)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>VLANTC</name>
							<description>12-bit VLAN tag comparison</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACRWUFFR</name>
					<displayName>MACRWUFFR</displayName>
					<description>Ethernet MAC remote wakeup frame filter
						register (ETH_MACRWUFFR)</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>MACPMTCSR</name>
					<displayName>MACPMTCSR</displayName>
					<description>Ethernet MAC PMT control and status register
						(ETH_MACPMTCSR)</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>Power down</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPE</name>
							<description>Magic Packet enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WFE</name>
							<description>Wakeup frame enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PHYE</name>
							<description>PMEB of PHY enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPR</name>
							<description>Magic packet received</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WFR</name>
							<description>Wakeup frame received</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PHYR</name>
							<description>wake-up frame flag bit of PHY</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GU</name>
							<description>Global unicast</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WFFRPR</name>
							<description>Wakeup frame filter register pointer
								reset</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACSR</name>
					<displayName>MACSR</displayName>
					<description>Ethernet MAC interrupt status register
						(ETH_MACSR)</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PMTS</name>
							<description>PMT status</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MMCS</name>
							<description>MMC status</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MMCRS</name>
							<description>MMC receive status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MMCTS</name>
							<description>MMC transmit status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSTS</name>
							<description>Time stamp trigger status</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACIMR</name>
					<displayName>MACIMR</displayName>
					<description>Ethernet MAC interrupt mask register
						(ETH_MACIMR)</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PMTIM</name>
							<description>PMT interrupt mask</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSTIM</name>
							<description>Time stamp trigger interrupt
								mask</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA0HR</name>
					<displayName>MACA0HR</displayName>
					<description>Ethernet MAC address 0 high register
						(ETH_MACA0HR)</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<resetValue>0x8000FFFF</resetValue>
					<fields>
						<field>
							<name>MACA0H</name>
							<description>MAC address0 high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MO</name>
							<description>Always 1</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA0LR</name>
					<displayName>MACA0LR</displayName>
					<description>Ethernet MAC address 0 low
						register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>MACA0L</name>
							<description>MAC address0 low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA1HR</name>
					<displayName>MACA1HR</displayName>
					<description>Ethernet MAC address 1 high register
						(ETH_MACA1HR)</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>MACA1H</name>
							<description>MAC address1 high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask byte control</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>SA</name>
							<description>Source address</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AE</name>
							<description>Address enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA1LR</name>
					<displayName>MACA1LR</displayName>
					<description>Ethernet MAC address1 low
						register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>MACA1L</name>
							<description>MAC address1 low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA2HR</name>
					<displayName>MACA2HR</displayName>
					<description>Ethernet MAC address 2 high register
						(ETH_MACA2HR)</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>MACA2H</name>
							<description>Ethernet MAC address 2 high
								register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask byte control</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>SA</name>
							<description>Source address</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AE</name>
							<description>Address enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA2LR</name>
					<displayName>MACA2LR</displayName>
					<description>Ethernet MAC address 2 low
						register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>MACA2L</name>
							<description>MAC address2 low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>31</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA3HR</name>
					<displayName>MACA3HR</displayName>
					<description>Ethernet MAC address 3 high register
						(ETH_MACA3HR)</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>MACA3H</name>
							<description>MAC address3 high</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask byte control</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>SA</name>
							<description>Source address</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AE</name>
							<description>Address enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MACA3LR</name>
					<displayName>MACA3LR</displayName>
					<description>Ethernet MAC address 3 low
						register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>MBCA3L</name>
							<description>MAC address3 low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PHY_CR</name>
					<displayName>PHY_CR</displayName>
					<description>PHY configure register</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<resetValue>0x40000001</resetValue>
					<fields>
						<field>
							<name>REPHYADDR</name>
							<description>when the bit 7 set 1,bit4-0 serves as the address of the
								PHY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PHYADDR_EN</name>
							<description>Reconfigure the PHY address</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SPEED</name>
							<description>Even Ethernet speed selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DUPlEX</name>
							<description>Even Ethernet mode selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PHY_EEE</name>
							<description>PHY work mode selection</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PHY_PD</name>
							<description>PHY pd mode selection</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PHY_RSTN</name>
							<description>Ethernet PHY global reset signal</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHKSUM_CR</name>
					<displayName>CHKSUM_CR</displayName>
					<description>CHKSUM configure register</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>Byte_En1</name>
							<description>Participate in the ip header checksum to
								calculate byte control bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>Byte_En2</name>
							<description>Participate in the ip header checksum to
								calculate byte control bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>Chksum_En</name>
							<description>the software sets 1 at the beginning of frame calculation
								and write 0
								at the end of frame calculation</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IP_PDR</name>
					<displayName>IP_PDR</displayName>
					<description>IP packet register</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IP_Payload</name>
							<description>IP data written by software,need to be used with
								ETH_CHKSUM_CR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHKSUM_HR</name>
					<displayName>CHKSUM_HR</displayName>
					<description>IP packet register</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>Chksum_Head_Result</name>
							<description>IP header checksum</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
