Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
				<register>
					<name>UEP4_TX_CTRL</name>
					<description>endpoint 4 send control register</description>
					<addressOffset>0xAE</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description> endpoint 4 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description> endpoint 4 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_T_NAK_ACT</name>
							<description>endpoint 4 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_T_DONE</name>
							<description>endpoint 4 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP4_RX_CTRL</name>
					<description>endpoint 4 receive control</description>
					<addressOffset>0xAF</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description>endpoint 4 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description>the reception of endpoint 4 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_TOG</name>
							<description>endpoint 4 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_ACT</name>
							<description>endpoint 4 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_DONE</name>
							<description>endpoint 4 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>UEP5_T_LEN</name>
					<description>endpoint 5 send the length register</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP_TX_LEN</name>
							<description> endpoint 5 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_TX_CTRL</name>
					<description>endpoint 5 send control register</description>
					<addressOffset>0xB2</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description> endpoint 5 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description> endpoint 5 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_T_NAK_ACT</name>
							<description>endpoint 5 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_T_DONE</name>
							<description>endpoint 5 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP5_RX_CTRL</name>
					<description>endpoint 5 receive control</description>
					<addressOffset>0xB3</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description>endpoint 5 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description>the reception of endpoint 5 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_TOG</name>
							<description>endpoint 5 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_ACT</name>
							<description>endpoint 5 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_DONE</name>
							<description>endpoint 5 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>UEP6_T_LEN</name>
					<description>endpoint 6 send the length register</description>
					<addressOffset>0xB4</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP_TX_LEN</name>
							<description> endpoint 6 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_TX_CTRL</name>
					<description>endpoint 6 send control register</description>
					<addressOffset>0xB6</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description> endpoint 6 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description> endpoint 6 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_T_NAK_ACT</name>
							<description>endpoint 6 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_T_DONE</name>
							<description>endpoint 6 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_CTRL</name>
					<description>endpoint 6 receive control</description>
					<addressOffset>0xB7</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description>endpoint 6 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description>the reception of endpoint 6 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_TOG</name>
							<description>endpoint 6 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_ACT</name>
							<description>endpoint 6 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_DONE</name>
							<description>endpoint 6 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>UEP7_T_LEN</name>
					<description>endpoint 7 send the length register</description>
					<addressOffset>0xB8</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP_TX_LEN</name>
							<description> endpoint 7 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP7_TX_CTRL</name>
					<description>endpoint 7 send control register</description>
					<addressOffset>0xBA</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description> endpoint 7 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description> endpoint 7 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_T_NAK_ACT</name>
							<description>endpoint 7 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_T_DONE</name>
							<description>endpoint 7 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP7_RX_CTRL</name>
					<description>endpoint 7 receive control</description>
					<addressOffset>0xBB</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_RES_MASK</name>
							<description>endpoint 7 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UEP_TOG_MASK</name>
							<description>the reception of endpoint 7 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_TOG</name>
							<description>endpoint 7 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UEP_R_NAK_ACT</name>
							<description>endpoint 7 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDP_R_DONE</name>
							<description>endpoint 7 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>UEP_T_ISO</name>
					<description>usb endpoint sends a synchronous mode enable register</description>
					<addressOffset>0xBC</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP_T_ISO</name>
							<description>upload endpoint(IN) synchronization mode enabled</description>
							<bitRange>[7:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>UEP_R_ISO</name>
					<description>usb endpoint receives a synchronous mode enable register</description>
					<addressOffset>0xBE</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP_R_ISO</name>
							<description>down endpoint(OUT) synchronization mode enabled</description>
							<bitRange>[7:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
