Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>USBHS_HOST</name>
			<description>USBHS Host mode functions' registers</description>
			<groupName>USBHS_HOST</groupName>
			<baseAddress>0x40404800</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>R8_UH_CFG</name>
					<description>USB host Configuration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x07</resetValue>
					<fields>
						<field>
							<name>ROOT_LINK_RESET</name>
							<description>USB connection controller module resets</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ROOT_SIE_RESET</name>
							<description>USB protocol processor reset</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ROOT_ALL_CLR</name>
							<description>clear all interrupt flags</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ROOT_PHY_SUSPENDM</name>
							<description>PHY suspend,close utmi clock</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ROOT_DMA_EN</name>
							<description>DMA transfer enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ROOT_SOF_EN</name>
							<description>sof packet sending function enabled</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ROOT_FORCE_FS</name>
							<description>forced full speed FS</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ROOT_LPM_EN</name>
							<description>LPM enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_INT_EN</name>
					<description>USB host interrupt enable register</description>
					<addressOffset>0x02</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>WKUP_ACT_IE</name>
							<description>Wakeup interrupt enabled</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESUME_ACT_IE</name>
							<description>bus recovery interrupt was enabled</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>USB_ACT_IE</name>
							<description>USB transfer end interrupt enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SOF_ACT_IE</name>
							<description>sof packet sending interruption is enabled</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>TX_HALT_IE</name>
							<description>send pause interrupt enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>FIFO_OV_IE</name>
							<description>FIFO overflow interrupt enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_DEV_ADDR</name>
					<description>USB host device address register</description>
					<addressOffset>0x03</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>DEV_ADDR</name>
							<description>device address</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_CONTROL</name>
					<description>USB host control register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RX_NO_RES</name>
							<description>IN-DATA no answer,used for synchronous transfer or
								high-speed SPLIT packets</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>TX_NO_RES</name>
							<description>OUT or SETUP DATA no reply is extended and is used for
								synchronous transmission or hign-speed SPLIT packets</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RX_NO_DATA</name>
							<description>DATA packets are not expected after IN token packets and
								are used for
								high-speed SPLIT packets</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>TX_NO_DATA</name>
							<description>OUT or SETUP token packet packets are followed by no data
								packets for hign-speed SPLIT packets</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>DOWN_LOWSPD</name>
							<description>this bit is enabled when the port is operating at full
								speed and needs to send low speed packets(PRE)</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SPLIT_VALID</name>
							<description>valid to send SPLIT packet</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>LPM_VALID</name>
							<description>valid to send LMP packet</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>HOST_ACTION</name>
							<description>host enables the transaction</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>BUF_MODE</name>
							<description>DATA cache control bit</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>TOG_MASK</name>
							<description>send data PID</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>ENDP_MASK</name>
							<description>transaction token packet endpoint number</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>PID_MASK</name>
							<description>transaction token packet PID</description>
							<bitRange>[3:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_INT_FLAG</name>
					<description>USB HOST interrupt flag register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<access>read-write</access>
					<fields>
						<field>
							<name>RB_WKUP_IF</name>
							<description>Wakeup interrupt flag</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_RESUME_ACT_IF</name>
							<description>bus recovery interrupt flag</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_USB_ACT_IF</name>
							<description>USB transaction transfer completion interrupt flag</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_SOF_ACT_IF</name>
							<description>sof packet delivert completion interrupt flag</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_TX_HALT_IF</name>
							<description>send pause interrupt flag</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_FIFO_OV_IF</name>
							<description>FIFO overflow interrupt flag</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_INT_ST</name>
					<description>USB host interrupt status</description>
					<addressOffset>0x09</addressOffset>
					<size>0x08</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>THIS_PID_MASK</name>
							<description>received PID</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>PORT_RX_RESUME</name>
							<description>A bit of indicates that the port received a wakeup signal</description>
							<bitRange>[4:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_MIS_ST</name>
					<description>USB host miscellaneous status</description>
					<addressOffset>0x0A</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_SOF_FREE</name>
							<description>port enabled state</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_SOF_PRE</name>
							<description>The state of the USB SOF packet is indicated as follows</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_SOF_ST</name>
							<description>USB bus SOF status</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_USB_WAKEUP</name>
							<description>USB bus wakes up</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINESTATE_MASK</name>
							<description>USB bus status</description>
							<bitRange>[5:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_BUS_J</name>
							<description>J on USB bus</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_BUS_SE0</name>
							<description>SE0 on USB bus</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_LPM</name>
					<description>USB host power management data register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPM_DATA</name>
							<description>power management data</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_SPLIT</name>
					<description>USB host SPLIT register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPLIT_DATA</name>
							<description>SPLIT management data</description>
							<bitRange>[18:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_FRAME</name>
					<description>USB host frame register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FRAME_NO</name>
							<description>the frame number</description>
							<bitRange>[10:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>MICRO_FRAME</name>
							<description>microfame number</description>
							<bitRange>[18:16]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>SOF_CNT_EN</name>
							<description>SOF count enabled</description>
							<bitRange>[24:24]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>SOF_CNT_CLR</name>
							<description>the SOF count is cleared</description>
							<bitRange>[25:25]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_TX_LEN</name>
					<description>USB host send length register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TX_LEN</name>
							<description>send data length</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_RX_LEN</name>
					<description>USB host receive length register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RX_LEN</name>
							<description>Received data length</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_RX_MAX_LEN</name>
					<description>USB host receives the maximum length register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UH_RX_MAX_LEN</name>
							<description>receives the maximum length</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_RX_DMA</name>
					<description>DMA receive address register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>R16_UH_RX_DMA</name>
							<description>Received address</description>
							<bitRange>[16:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_TX_DMA</name>
					<description>DMA send address register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>R16_UH_TX_DMA</name>
							<description>Send address</description>
							<bitRange>[16:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_CTRL</name>
					<description>USB host port control register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BUS_RST_LONG</name>
							<description>BUS reset time selection</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>PORT_SLEEP_BESL</name>
							<description>wake-up time control</description>
							<bitRange>[15:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR_PORT_SLEEP</name>
							<description>the PORT exits the sleep state (LPM)</description>
							<bitRange>[8:8]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_PORT_CONNECT</name>
							<description>bring the PORT into the port state</description>
							<bitRange>[5:5]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_PORT_EN</name>
							<description>PORT exits the enabled state and enters the DISABLED state</description>
							<bitRange>[4:4]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_PORT_SLEEP</name>
							<description>the PORT goes to sleep(LPM)</description>
							<bitRange>[3:3]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_PORT_SUSP</name>
							<description>the PORT exits the suspended state</description>
							<bitRange>[2:2]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_PORT_SUSP</name>
							<description>the PORT is in a suspended state</description>
							<bitRange>[1:1]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_PORT_RESET</name>
							<description>PORT send reset</description>
							<bitRange>[0:0]</bitRange>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_CFG</name>
					<description>USB host port Configuration register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>PORT_RPD</name>
							<description>the 15k resistance drop-down function is enable in host
								mode</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>HOST_MODE</name>
							<description>USB port mode selection</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_INT_EN</name>
					<description>USB host port interrupt enable register</description>
					<addressOffset>0x32</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>PORT_SLP_IE</name>
							<description>port sleep state change interrupt enabled</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>PORT_RESET_IE</name>
							<description>port reset state change interrupt enabled</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>PORT_SUSP_IE</name>
							<description>port pause state change interrupt enabled</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>PORT_EN_IE</name>
							<description>port enable state change interrupt enabled</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>PORT_CONNECT_IE</name>
							<description>port connection state change interrupt enabled</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_TEST_CT</name>
					<description>USB host port test mode register</description>
					<addressOffset>0x33</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TEST_FORCE_EN</name>
							<description>test mode was enabled</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>TEST_K</name>
							<description>test output K</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>TEST_J</name>
							<description>test output J</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_STATUS</name>
					<description>USB host port status register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x10</size>
					<resetValue>0x0010</resetValue>
					<fields>
						<field>
							<name>PORT_TEST</name>
							<description>whether the port is in test mode</description>
							<bitRange>[11:11]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>PORT_HIGH_SPD</name>
							<description>whether the port connection speed is hign</description>
							<bitRange>[10:10]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>PORT_LOW_SPD</name>
							<description>whether the port connection speed is low</description>
							<bitRange>[9:9]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>PORT_SLP</name>
							<description>port sleep</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>PORT_RESTTING</name>
							<description>port reset status</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>PORT_SUSP</name>
							<description>port pause state</description>
							<bitRange>[2:2]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>PORT_EN</name>
							<description>port enabled</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>PORT_C0NNECT</name>
							<description>port connection state</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROOT_BC_CTRL</name>
					<description>USB host BC charging control register</description>
					<addressOffset>0x3c</addressOffset>
					<size>0x20</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>UDM_VSRC_ACT</name>
							<description>In automatic mode, UDP outputs VBC_SRC ,otherwise it is
								controlled by UDM_BC_CMPE</description>
							<bitRange>[10:10]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UDM_BC_VSRC</name>
							<description>UDM pin BC protocol source voltage enabled</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UDP_BC_VSRC</name>
							<description>UDP pin BC protocol source voltage enabled</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>BC_AUTO_MODE</name>
							<description>Automatic mode enables</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UDM_BC_CMPE</name>
							<description>UDM pin BC protocol comparator enables</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UDP_BC_CMPE</name>
							<description>UDP pin BC protocol comparator enables</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>UDM_BC_CMPO</name>
							<description>UDM pin BC protocol comparator status</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>UDP_BC_CMPO</name>
							<description>UDP pin BC protocol comparator status</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
