Community-PIO-CH32V/platform-ch32v/misc/svd/CH564.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>USBHS_HSI</name>
			<description>USBHS HSI calibration register</description>
			<groupName>USBHS_HSI</groupName>
			<baseAddress>0x40405000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>HSI_CAL_CTRL</name>
					<description>HSI clock calibration control register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<resetValue>0x0021C045</resetValue>
					<fields>
						<field>
							<name>CAL_RST</name>
							<description>the calibration module is globally reset</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>CAL_EN</name>
							<description>alignment enabled</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>SFT_RST</name>
							<description>exti fine calibration mode and receive that BUS_RESET
								should be set</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>SOF_FREE</name>
							<description>the uplink interface enters the enable mode</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>CLK_SEL</name>
							<description>clock selection</description>
							<bitRange>[28:28]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
